#include<stdio.h>

int main() {
    int *p, a[3][4] = {{1, 3, 5, 7},
                       {2, 4, 6, 8},
                       {1, 1, 2, 5}};
//    printf("p 指针指向的地址:%d\n",*p);//请使用指针前将该指针指向一个具体地址，该做法报错0xc0000005
    printf("%d,%d\n", a, *a);               //0行起始地址 0行0列元素地址
    printf("%d,%d\n", a[0], *(a + 0));        //0行0列元素地址
    printf("%d,%d\n", &a[0], &a[0][0]);     //0行起始地址 0行0列元素地址

    printf("%d,%d\n", a[1], a + 1);               //1行0列元素地址 1行起始地址
    printf("%d,%d\n", &a[1][0], *(a + 1) + 0);      //1行0列元素地址

    printf("%d,%d\n", a[2], *(a + 2));             //2行0列元素地址 2行起始地址
    printf("%d,%d\n", &a[2], a + 2);               //2行起始地址

    printf("%d,%d\n", a[1][0], *(*(a + 1) + 0));           //1行0列元素的值
    printf("%d,%d\n", *a[2], *(*(a + 2) + 0));               //2行0列元素的值
    return 0;
}

